---
kind: other
id: Properties.T:Autodesk.Revit.UI.UIControlledApplication
source: html/7202a350-c4e2-8aa1-de01-1b75085fe498.htm
---
# UIControlledApplication Properties

Get current active external application or external command id.